46/app/Controllers/user/Artikelctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
---
    public function index()
    {
        $lang = session()->get('lang') ?? 'en';
        // Ambil data profil, slider, dan artikel terbaru
        $profil = $this->ProfilModel->findAll();
        $slider = $this->SliderModel->findAll();

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
---
        }


        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelTerbaru' => $artikelTerbaru,
            'lang' => $lang
        ];

SELECT *
FROM `tb_artikel`
WHERE `slug_id` = 'manfaat-memberikan-bunga-bucket-sebagai-hadiah'
 LIMIT 1
SELECT *
FROM `tb_profil`
---
    public function detail($slug)
    {
        // Tentukan bahasa yang aktif dari session atau locale
        $locale = session('lang') ?? service('request')->getLocale();

        // Tentukan field slug berdasarkan bahasa yang aktif
        if ($locale == 'en') {
            $artikel = $this->ArtikelModel->where('slug_en', $slug)->first();
        } else {
            $artikel = $this->ArtikelModel->where('slug_id', $slug)->first();
        }

        if (!$artikel) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Artikel dengan slug $slug tidak ditemukan");
        }

        // Tentukan judul halaman berdasarkan bahasa
        $title = ($locale === 'en') ? 'Articles' : 'Artikel';

        // Tentukan field judul dan deskripsi berdasarkan bahasa yang aktif
        if ($locale == 'en') {
            $judul_artikel = $artikel->judul_inggris ?? $artikel->judul_artikel; // Fallback ke judul default jika tidak ada
            $deskripsi_artikel = $artikel->description_inggris ?? $artikel->deskripsi_artikel;
        } else {
            $judul_artikel = $artikel->judul_artikel ?? $artikel->judul_artikel;
            $deskripsi_artikel = $artikel->deskripsi_artikel ?? $artikel->deskripsi_artikel;
        }

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => $artikel,
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($artikel->id_artikel, 4),
            'judul_artikel' => $judul_artikel,
            'deskripsi_artikel' => $deskripsi_artikel,
            'lang' => $locale
        ];